// : Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// for (int i = 0; i < 20; i++)
// {
//     int number = new Random().Next(10, 1000);
//     int n1 = number / 10;
//     int n2 = number % 10;
//     int n3 = number % 100;
//     int result = (n3-n2)/10;
//     Console.WriteLine ($"{number}-> вторая цифра {result} ");
// }
